# WEEK 4

Writing to CSV and EXCEL along with somne basic data cleaning

# Dealing with CSV

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('stock_data.csv')

In [3]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## How to work if there are headers in the CSV file

In [7]:
df=pd.read_csv('stock_data.csv',header=0)

In [5]:
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [8]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Playing with Headers and Skiprows

In [17]:
df=pd.read_csv('stock_data.csv')

In [18]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## If there is no header , you are supposed to make the headers then how you do it?

Sometimes you need to replace the existing header, how do you do ?

In [25]:
df=pd.read_csv('stock_data.csv',header=0,names=['Company Name','Stock price','Avg','Something','Owner'])
df

  Company Name    Stock price  Avg Something          Owner
0        GOOGL          27.82   87       845     larry page
1          WMT           4.61  484        65           n.a.
2         MSFT             -1   85        64     bill gates
3         RIL   not available   50      1023  mukesh ambani
4         TATA            5.6   -1      n.a.     ratan tata

## How do you clean some of the cells ?

In [26]:
df

  Company Name    Stock price  Avg Something          Owner
0        GOOGL          27.82   87       845     larry page
1          WMT           4.61  484        65           n.a.
2         MSFT             -1   85        64     bill gates
3         RIL   not available   50      1023  mukesh ambani
4         TATA            5.6   -1      n.a.     ratan tata

Lets say we are changing the name of the owner

In [ ]:
df.Owner.na_value=['n.a.']
df

# This is not working

  Company Name    Stock price  Avg Something          Owner
0        GOOGL          27.82   87       845     larry page
1          WMT           4.61  484        65           n.a.
2         MSFT             -1   85        64     bill gates
3         RIL   not available   50      1023  mukesh ambani
4         TATA            5.6   -1      n.a.     ratan tata

In [59]:
df=pd.read_csv('stock_data.csv',header=0,names=['Company Name','Stock price','Avg','Something','Owner'],na_values=['n.a.','not available'])
df

# na_value works only in the read_csv method

  Company Name  Stock price  Avg  Something          Owner
0        GOOGL        27.82   87      845.0     larry page
1          WMT         4.61  484       65.0            NaN
2         MSFT        -1.00   85       64.0     bill gates
3         RIL           NaN   50     1023.0  mukesh ambani
4         TATA         5.60   -1        NaN     ratan tata

## what if i wanted only -1 in the avg to be Nan not the stock price

In [74]:
df=pd.read_csv('stock_data.csv',header=0,names=['Company Name','Stock price','Avg','Something','Owner'],
               na_values={'Owner':['n.a.','not available'],
                          'Avg':[-1,'n.a.'],
                          'Something': ['n.a.','not available' ]
                          })
df.set_index('Company Name',inplace=True)
df

                Stock price    Avg  Something          Owner
Company Name
GOOGL                 27.82   87.0      845.0     larry page
WMT                    4.61  484.0       65.0            NaN
MSFT                     -1   85.0       64.0     bill gates
RIL           not available   50.0     1023.0  mukesh ambani
TATA                    5.6    NaN        NaN     ratan tata

We are using the power of dictionries to the na_values

In [62]:
df.to_csv('new.csv')

## Write to csv without index

In [63]:
df.to_csv('new_withoutindex.csv',index=False)

## Write to CSV with only 2 columsn

In [65]:
df.to_csv('new_only2.csv',index=False,columns=['Company Name','Owner'])

## Export without Header

In [66]:
df.to_csv('new_noheader.csv',index=False,header=0)

# WORKING WITH EXCEL

## How to Write 2 DataFrames in same excel , with different sheets

## How to Write a DataFrame with some offset

## How to read from excel